{
    "en": {
        "quick_info": [
            "Master's student in AI",
            "Aspiring Developer"
        ],
        "navigation": {
            "about": "About",
            "portfolio": "Portfolio",
            "experience": "Experience",
            "education": "Education",
            "resume": "Resume"
        },
        "about": [
            "Welcome! 👋", 
            "I'm an aspiring developer with a passion for tackling new challenges and continually learning. I'm motivated by personal growth and the opportunity to contribute meaningfully to the projects I'm part of.", 
            "Currently, I'm pursuing my master's degree in Artificial Intelligence and Computer Networks at CNAM (National Conservatory of Arts and Professions) in Paris, France. I've delved into topics like AI, Operations Research, and Computer Architecture, and I'm excited to expand my knowledge in the coming semesters.", 
            "Alongside my studies, I've gained hands-on experience in both customer service, marketing, and business. At Fidelity Investments, I worked closely with a mentor from the tech department on Java-based projects. During my time at AIESEC in France, I built a program that connected to our organization's GraphQL API to automate data management tasks like updating spreadsheets. As a high school student, I created my own lawn mowing business, reaching 30 regular clients in just 5 years.",
            "In my down time, I love to explore Paris, make music, snowboard, travel, and work on coding projects."
        ],
        "portfolio": [
            {
                "title": "Crypto Trader",
                "description": "Building an automated system in Golang to place trades for cryptocurrencies that implements custom trading strategies defined by users. Programmed a client for the Kraken Crypto exchange Rest and Websocket APIs. Implementing concurrency, channels, mutexes & linked lists. Using InfluxDB for time series data storage.",
                "url": "https://github.com/GrantCanty/bruit",
                "tech_stack": [
                    "Go"
                ],
                "img_path": "../images/bruit.png"
            },
            {
                "title": "Flashcards",
                "description": "Developed a flashcard Web App using React for front end and Golang for back end. Users can edit or review flashcard decks as well as create new flashcard decks. Each flashcard deck contains individual flashcards with a description and an answer. Flashcard decks and each flashcard are saved in memory. This project takes advantage of the React Router for the different edit/review functionalities and state for a  form to input data to create new flashcard decks.",
                "url": "https://github.com/GrantCanty/flashcards",
                "tech_stack": [
                    "Go",
                    "React",
                    "JavaScript",
                    "CSS"
                ]
            },
            {
                "title": "Quizzy",
                "description": "Designed a program using C++ that lets a user create a quiz containing true/false, multiple choice, and longanswer questions. This project takes advantage of inheritance by using an Answer parent class that is extended by children classes with their respective answer types. The quiz is able to be saved locally as a text file.",
                "url": "https://github.com/GrantCanty/quizzy",
                "tech_stack": [
                    "C++"
                ]
            },
            {
                "title": "SkiView",
                "description": "Created a Web App in React to provide current weather conditions at ski resorts using a resort's longitude and latitude coordinates. The list of ski resorts can be edited.",
                "url": "https://ski-view.vercel.app/",
                "tech_stack": [
                    "React",
                    "JavaScript"
                ]
            }
        ],
        "experience": [
            {
                "start": "2021",
                "end": "2024",
                "type": "Full Time",
                "company": "Fidelity Investments",
                "title": "High Net Worth Associate",
                "description": [
                    "Provided efficient communication strategies on product and service calls, averaging over 5 clients per hour.",
                    "Maintained high attention to detail with 0 errors on equity and mutual fund trades in client accounts.",
                    "Problem solved and troubleshooted errors on website using system applications in client accounts."
                ]
            },
            {
                "start": "2020",
                "end": "2021",
                "type": "Internship",
                "company": "AIESEC in France",
                "title": "Head of Marketing",
                "description": [
                    "Built the organization's 1st system to automatically update data trackers using Google Apps Scripts, Google Sheets, and the AIESEC GraphQL API.",
                    "Created an emailing system that sent email templates to leads using Google Sheets and Google Apps Scripts.",
                    "Conducted semi-annual PESTEL, SWOT, competitor analyses, and market research to gather insights and adjust organizational processes to better fit the needs of our customers and industry environment.",
                    "Delivered 21 sessions at 7 conferences and bi-weekly meetings with marketing team members.",
                    "Grew followers on LinkedIn and Instagram by 17% & 11% with no paid in-platform advertisements."
                ]
            }
        ],
        "education": [
            {
                "start": "2024",
                "end": "Present",
                "university": "CNAM",
                "location": "Paris, France",
                "major": "Artificial Intelligence and Computer Networks",
                "description": "Taking courses on Artificial Intelligence, Operational Research, Computer Architecture & more."
            },
            {
                "start": "2017",
                "end": "2021",
                "university": "Ohio University",
                "location": "Athens, Ohio, USA",
                "major": "Finance, International Business",
                "description": "Completed 2 majors in Finance and International Business, taking classes on Financial Valuation, International Market Entry, Bank Management, Cross Cultural Leadership & more."
            }
        ]
    },
    "fr": {
        "quick_info": [
            "Étudiant en master en IA",
            "Développeur en devenir"
        ],
        "navigation": {
            "about": "A propos",
            "portfolio": "Projets",
            "experience": "Expérience",
            "education": "Éducation",
            "resume": "Resumé"
        },
        "about": [
            "Bienvenue ! 👋",
            "Je suis un développeur en devenir avec une passion pour relever de nouveaux défis et apprendre continuellement. Je suis motivé par le développement personnel et l'opportunité de contribuer de manière significative aux projets auxquels je participe.",
            "Actuellement, je poursuis un master en Intelligence Artificielle et Réseaux Informatiques au CNAM à Paris. J'ai exploré des sujets tels que l'intelligence artificielle, la recherche opérationnelle et l'architecture informatique, et je suis enthousiaste à l'idée d'élargir mes connaissances au cours des prochains semestres.",
            "En parallèle de mes études, j'ai acquis une expérience pratique dans les domaines du service client, du marketing et des affaires. Chez Fidelity Investments, j'ai collaboré avec un mentor du département technique sur des projets basés sur Java. Pendant mon passage chez AIESEC en France, j'ai conçu un programme qui se connectait à l'API GraphQL de notre organisation pour automatiser des tâches de gestion des données, comme la mise à jour de feuilles de calcul. En tant que lycéen, j'ai créé ma propre entreprise de tonte de pelouse, atteignant 30 clients réguliers en seulement 5 ans.",
            "Pendant mon temps libre, j'adore explorer Paris, faire de la musique, du snowboard, voyager, et travailler sur des projets de programmation."
        ],
        "portfolio": [
            {
                "title": "Client Crypto",
                "description": "Un système automatisé en Golang pour placer des transactions pour les cryptocurrencies qui met en œuvre des stratégies de trading personnalisées définies par les utilisateurs. Programmation d'un client pour les API Rest et Websocket de la bourse de crypto-monnaies Kraken. Mise en œuvre de la concurrence, des canaux, des mutex et des listes liées. Utilisation d'InfluxDB pour le stockage de données de séries temporelles.",
                "url": "https://github.com/GrantCanty/bruit",
                "tech_stack": [
                    "Go"
                ]
            },
            {
                "title": "Flashcards",
                "description": "Application web de flashcards en utilisant React pour le front-end et Golang pour le back-end. Les utilisateurs peuvent éditer ou réviser des jeux de flashcards, créer de nouveaux jeux de flashcards et ajouter des flashcards. Les flashcards sont sauvegardées sur le serveur. Ce projet tire parti de React Router pour les différentes fonctionnalités d'édition/révision et de State pour un formulaire de saisie de données permettant de créer de nouveaux jeux de flashcards.",
                "url": "https://github.com/GrantCanty/flashcards",
                "tech_stack": [
                    "Go",
                    "React",
                    "JavaScript",
                    "CSS"
                ]
            },
            {
                "title": "Quizzy",
                "description": "Programme en C++ qui permet à l'utilisateur de créer un quiz contenant des questions vrai/faux, à choix multiples et à réponse longue. Ce projet tire parti de l'héritage en utilisant une classe parentale Answer qui est étendue par des classes enfants avec leurs types de réponses respectifs. Le quiz peut être sauvegardé localement sous forme de fichier texte.",
                "url": "https://github.com/GrantCanty/quizzy",
                "tech_stack": [
                    "C++"
                ]
            },
            {
                "title": "SkiView",
                "description": "J'ai créé une application Web en React pour fournir les conditions météorologiques actuelles dans les stations de ski en utilisant les coordonnées de longitude et de latitude d'une station. La liste des stations de ski peut être modifiée.",
                "url": "https://ski-view.vercel.app/",
                "tech_stack": [
                    "React",
                    "JavaScript"
                ]
            }
            
        ],
        "experience": [
            {
                "start": "2021",
                "end": "2024",
                "type": "Temps plein",
                "company": "Fidelity Investments",
                "title": "Associé des clients fortunés",
                "description": [
                    "Mise en place de stratégies de communication efficaces pour les appels concernant les services.",
                    "Maintenu un taux de 0 erreur lors des achats des investissements sur les comptes de clients.",
                    "Dépanné des erreurs sur le site web en utilisant les applications de l'entreprise dans les comptes clients."
                ]
            },
            {
                "start": "2020",
                "end": "2021",
                "type": "Stage",
                "company": "AIESEC in France",
                "title": "Responsable marketing",
                "description": [
                    "Mise en place du premier système de l'organisation pour mettre à jour automatiquement les traqueurs de données en utilisant des scripts Google Apps, Google Sheets et l'API GraphQL d'AIESEC.",
                    "Conception d'un système d'emailing pour prospects marketing avec scripts Google Apps & Sheets.",
                    "Réalisation d'analyses semestrielles PESTEL, SWOT et veille de la concurrence, suivi d'études de marché afin de recueillir des informations et d'adapter les processus organisationnels.",
                    "Présentation de 21 sessions lors de 7 conférences et réunions bi-hebdomadaires avec l'équipe marketing.",
                    "Augmentation organique du nombre d'abonnements sur LinkedIn et Instagram de 17 % et 11 %."
                ]
            }
        ],
        "education": [
            {
                "start": "2024",
                "end": "Présent",
                "university": "CNAM",
                "location": "Paris",
                "major": "Intelligence artificielle et réseaux informatiques",
                "description": "Je suis des cours sur l'intelligence artificielle, la recherche opérationnelle, l'architecture informatique, etc."
            },
            {
                "start": "2017",
                "end": "2021",
                "university": "Ohio University",
                "location": "Athens, Ohio, États-Unis",
                "major": "Finance, Commerce internationale",
                "description": "J'ai complété deux majeures en finance et en commerce international, en suivant des cours sur l'évaluation financière, l'entrée sur le marché international, la gestion bancaire, le leadership interculturel et plus encore."
            }
        ]
    }
}