{
    "en": {
        "about": [
            "Welcome! 👋", 
            "I'm an aspiring developer with a passion for tackling new challenges and continually learning. I'm motivated by personal growth and the opportunity to contribute meaningfully to the projects I'm part of.", 
            "Currently, I'm pursuing my master's degree in Artificial Intelligence and Computer Networks at CNAM (National Conservatory of Arts and Professions) in Paris, France. I've delved into topics like AI, Operations Research, and Computer Architecture, and I'm excited to expand my knowledge in the coming semesters.", 
            "Alongside my studies, I've gained hands-on experience in both customer service, marketing, and business. At Fidelity Investments, I worked closely with a mentor from the tech department on Java-based projects. During my time at AIESEC in France, I built a program that connected to our organization's GraphQL API to automate data management tasks like updating spreadsheets. As a high school student, I created my own lawn mowing business, reaching 30 regular clients in just 5 years.",
            "In my down time, I love to explore Paris, make music, snowboard, travel, and work on coding projects."
        ],
        "experience": [
            {
                "start": "2021",
                "end": "2024",
                "type": "Full Time",
                "company": "Fidelity Investments",
                "title": "High Net Worth Associate",
                "description": "test test test test test"
            },
            {
                "start": "2020",
                "end": "2021",
                "type": "Internship",
                "company": "AIESEC in France",
                "title": "Head of Marketing",
                "description": "test test test test test"
            }
        ]
    },
    "fr": {
        "about": [
            "Bienvenue ! 👋",
            "Je suis un développeur en devenir avec une passion pour relever de nouveaux défis et apprendre continuellement. Je suis motivé par le développement personnel et l'opportunité de contribuer de manière significative aux projets auxquels je participe.",
            "Actuellement, je poursuis un master en Intelligence Artificielle et Réseaux Informatiques au CNAM à Paris, France. J'ai exploré des sujets tels que l'intelligence artificielle, la recherche opérationnelle et l'architecture informatique, et je suis enthousiaste à l'idée d'élargir mes connaissances au cours des prochains semestres.",
            "En parallèle de mes études, j'ai acquis une expérience pratique dans les domaines du service client, du marketing et des affaires. Chez Fidelity Investments, j'ai collaboré avec un mentor du département technique sur des projets basés sur Java. Pendant mon passage chez AIESEC en France, j'ai conçu un programme qui se connectait à l'API GraphQL de notre organisation pour automatiser des tâches de gestion des données, comme la mise à jour de feuilles de calcul. En tant que lycéen, j'ai créé ma propre entreprise de tonte de pelouse, atteignant 30 clients réguliers en seulement 5 ans.",
            "Pendant mon temps libre, j'adore explorer Paris, faire de la musique, du snowboard, voyager, et travailler sur des projets de programmation."

        ]
    }
}